Config/Documents/ПакетВыгрузкиОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПакетВыгрузкиОтчетности</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеПериодыПредоставленияОтчетности</v8:Type>
						<v8:Type>cfg:CatalogRef.Периоды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВыгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорматыВыгрузкиБухгалтерскойОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВыгрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыгрузкиФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИДОбработкиФормата</Name>
					<Comment>Нужен чтобы понимать какой обработкой был сформирован этот документ даже если в обработку заменили в формате</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаЭкспорта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиЭкспортаФайловОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеквизитыФормата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтчетыПакета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОтчетСсылка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УниверсальныйРегламентированныйОтчет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОтчетнойФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Протокол</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УниверсальныйРегламентированныйОтчет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстСообщения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Важность</Name>
							<Comment>Возможны значения: Обычное,Информация,Важное</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФайлыОтчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеФайлов</Name>
							<Comment>Двоичные данные zip архива с файлами группы отчетов</Comment>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Зависимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИсходныйОтчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УниверсальныйРегламентированныйОтчет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчетнаяФорма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыбранныйОтчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УниверсальныйРегламентированныйОтчет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДопДанныеГрупп</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОтправляемогоДокумента</Name>
							<Comment>Используется для отправки в ФНС</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОтправляемыхДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодИФНС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКорректировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭлектронныеЦифровыеПодписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КомуВыданСертификат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отпечаток</Name>
							<Comment>Отпечаток сертификата</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сертификат</Name>
							<Comment>Двоичные данные сертификата</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПодписи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстановившийПодпись</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутиПодписей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СертификатСсылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрисоединенныеФайлыОтчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОтчетСсылка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УниверсальныйРегламентированныйОтчет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФайлСсылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УниверсальныйРегламентированныйОтчетПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/ИсторияСостоянийПакетаОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСостоянийПакетаОтчетов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПакетаОтчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПротоколОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПротоколИмпорта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПротоколПроверки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПакетОтчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПакетВыгрузкиОтчетности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/СпособыВыгрузкиФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыВыгрузкиФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Каталог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменСФНС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WebСервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ПакетВыгрузкиОтчетности/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения	
	
	Элементы.ПрисоединенныеФайлыОтчетов.Видимость = ТекущийОбъект.ПрисоединенныеФайлыОтчетов.Количество();
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеСтраницамиПараметровВыгрузки();
	УправлениеВидимостьюСтраницыЭЦП();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ИсторияСостояний.КомпоновщикНастроек.Настройки.Отбор, , Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно, "Ссылка", Истина);
	ДатаНовогоСостояния = ТекущаяДатаСеанса();
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьТеряемыеДанныеВОбъект(ТекущийОбъект);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВыгруженныеОтчеты

&НаКлиенте
Процедура ВыгруженныеОтчетыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные  = Объект.ОтчетыПакета.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.ОтчетСсылка);
	
	ОткрытьФорму("Документ.УниверсальныйРегламентированныйОтчет.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгруженныеОтчетыПриАктивизацииСтроки(Элемент)
	ОтчетСсылка = Неопределено;
	ТекДанные = Элементы.ВыгруженныеОтчеты.ТекущиеДанные;
	Если ТекДанные<>Неопределено Тогда
		ОтчетСсылка = ТекДанные.ОтчетСсылка;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПрисоединенныеФайлыОтчетов

&НаКлиенте
Процедура ПрисоединенныеФайлыОтчетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.ПрисоединенныеФайлыОтчетов.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ПоказатьЗначение(,ТекДанные.ФайлСсылка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодписатьОтчетыЭЦП(Команда)
	
	СтруктураДанных = ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиент.СформироватьСтруктуруДанныхДляУстановкиПодписей();
	СтруктураДанных.ОписаниеПодписываемогоОбъекта = Объект.Ссылка; 
	СтруктураДанных.УидФормы = УникальныйИдентификатор;


	СтруктураДанных.РежимПредварительногоВыбораСертификатов = Ложь;

	
	ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиент.ВыбратьСертификатыДляПодписи(СтруктураДанных);
	
	ЗаполнитьОписаниеФайловДляФормированияПодписейНаКлиенте(СтруктураДанных);
	
	ОбработкаЗаписи = Новый ОписаниеОповещения("ЗаписатьНовыеПодписиВОбъектНаКлиенте", ЭтаФорма, СтруктураДанных);	
	ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиент.СоздатьПодписи(СтруктураДанных, ОбработкаЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСертификат(Команда)
	ТекДанные = Элементы.ЭлектронныеЦифровыеПодписи.ТекущиеДанные;
	Если ТекДанные<>Неопределено Тогда

	ЭлектроннаяПодписьКлиент.ОткрытьСертификат(ТекДанные.СертификатСсылка);	

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЭЦП(Команда)
	
	ТекущиеДанные = Элементы.ЭлектронныеЦифровыеПодписи.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	УдалитьЭЦПНаСервере(ТекущиеДанные.ИсходныйНомерСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСостояние(Команда)
	Если не ЗначениеЗаполнено(ДатаНовогоСостояния) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указана дата нового состояния.'"),Объект.Ссылка,"ДатаНовогоСостояния");
		Возврат;
	КонецЕсли;
	Если не ЗначениеЗаполнено(НовоеСостояние) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указано состояние.'"),Объект.Ссылка,"НовоеСостояние");
		Возврат;
	КонецЕсли;
	
	ДобавитьСостояниеНаСервере(ДатаНовогоСостояния, НовоеСостояние, Объект.Ссылка);
	
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ИсторияСостоянийПакетаОтчетов"));
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ДобавитьСостояниеНаСервере(Дата,Состояние,Ссылка)
	
	МенеджерЗаписи = РегистрыСведений.ИсторияСостоянийПакетаОтчетов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = Дата;
	МенеджерЗаписи.ПакетОтчетов = Ссылка;
	МенеджерЗаписи.Состояние = Состояние;
	МенеджерЗаписи.Записать();	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТеряемыеДанные()
	
	Если ЗначениеЗаполнено(АдресТеряемыхНаКлиентеДанных) Тогда 
		Возврат ПолучитьИзВременногоХранилища(АдресТеряемыхНаКлиентеДанных);
	КонецЕсли;
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	СтруктураТеряемыхДанных = Новый Структура;
	СтруктураТеряемыхДанных.Вставить("ФайлыОтчетов");
	
	АдресТеряемыхНаКлиентеДанных = ПоместитьВоВременноеХранилище(СтруктураТеряемыхДанных,УникальныйИдентификатор);
	
	ОбновитьТеряемыеДанные(ТекущийОбъект,"ФайлыОтчетов");
	
	Возврат СтруктураТеряемыхДанных; 
	
КонецФункции

&НаСервере
Процедура ОбновитьТеряемыеДанные(ТекущийОбъект,ЭлементыДляОбновления)
	
	СтруктураТеряемыхДанных = ПолучитьТеряемыеДанные();
	
	МассивЭлементовДляОбновления = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ЭлементыДляОбновления,,Истина);
	
	Для Каждого ЭлементДляОбновления Из МассивЭлементовДляОбновления Цикл 
		Если ЭлементДляОбновления = "ФайлыОтчетов" Тогда 
			СтруктураТеряемыхДанных[ЭлементДляОбновления] = ТекущийОбъект[ЭлементДляОбновления].Выгрузить();
		КонецЕсли;
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(СтруктураТеряемыхДанных,АдресТеряемыхНаКлиентеДанных);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьТеряемыеДанныеВОбъект(ТекущийОбъект)
	
	СтруктураТеряемыхДанных = ПолучитьТеряемыеДанные();	
	
	ТекущийОбъект.ФайлыОтчетов.Загрузить(СтруктураТеряемыхДанных.ФайлыОтчетов); 
	
КонецПроцедуры	

&НаСервере
Процедура УправлениеСтраницамиПараметровВыгрузки()
	
	ИмяТранспорта = ПолучитьПолноеИмяПредопределенногоЗначения(Объект.СпособВыгрузки);
	
	Если ИмяТранспорта = "Перечисление.СпособыВыгрузкиФайлов.Каталог" Тогда 
		НужнаяСтаница = Элементы.ВыгрузкаВКаталог;
		
	ИначеЕсли ИмяТранспорта = "Перечисление.СпособыВыгрузкиФайлов.FTP" Тогда 
		НужнаяСтаница = Элементы.ВыгрузкаFTP;
		
	ИначеЕсли ИмяТранспорта = "Перечисление.СпособыВыгрузкиФайлов.ЭлектроннаяПочта" Тогда 
		НужнаяСтаница = Элементы.ВыгрузкаЧерезEmail;

		
	ИначеЕсли ИмяТранспорта = "Перечисление.СпособыВыгрузкиФайлов.ОбменСФНС" Тогда 
		НужнаяСтаница = Элементы.ВыгрузкаВФНС;
		
	ИначеЕсли ИмяТранспорта = "Перечисление.СпособыВыгрузкиФайлов.WebСервис" Тогда 
		НужнаяСтаница = Элементы.ВыгрузкаЧерезWebСервис;
	
	Иначе
		НужнаяСтаница = Элементы.ВыгрузкаВКаталог;

	КонецЕсли;	
	
	НужнаяСтаница.Видимость = Истина;
	Элементы.СтраницыПараметровВыгрузки.ТекущаяСтраница = НужнаяСтаница;
	
	Для Каждого СтраницаПараметровВыгрузки Из Элементы.СтраницыПараметровВыгрузки.ПодчиненныеЭлементы Цикл 
		Если СтраницаПараметровВыгрузки = НужнаяСтаница Тогда 
			Продолжить;
		КонецЕсли;	
		СтраницаПараметровВыгрузки.Видимость = Ложь;
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура УправлениеВидимостьюСтраницыЭЦП()
	
	Элементы.ГруппаСтраницаЭЦП.Видимость = ВыгрузкаРегламентированнойБухгалтерскойОтчетности.ПоказыватьСтраницуЭЦП(Объект.СпособВыгрузки);
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьОписаниеФайловДляФормированияПодписейНаКлиенте(СтруктураДанных)
	Если СтруктураДанных.Отказ Тогда 
		Возврат;  
	КонецЕсли;	
	
	ЗаполнитьОписаниеФайловДляФормированияПодписейНаСервере(СтруктураДанных);
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьОписаниеФайловДляФормированияПодписейНаСервере(СтруктураДанных)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ЗаписатьТеряемыеДанныеВОбъект(ТекущийОбъект);
	
	ТекущийОбъект.ЗаполнитьОписаниеФайловДляФормированияПодписей(СтруктураДанных);
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаписатьНовыеПодписиВОбъектНаКлиенте(Результат ,СтруктураДанных) Экспорт 
	Если СтруктураДанных.Отказ Тогда 
		Возврат;  
	КонецЕсли;
	
	ЗаписатьНовыеПодписиВОбъектНаСервере(СтруктураДанных);	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНовыеПодписиВОбъектНаСервере(СтруктураДанных)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ЗаписатьТеряемыеДанныеВОбъект(ТекущийОбъект);

	
	ТекущийОбъект.ДобавитьНовыеПодписи(СтруктураДанных);
	
	ОбновитьТеряемыеДанные(ТекущийОбъект,"ФайлыОтчетов");
	ЗначениеВДанныеФормы(ТекущийОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЭЦПНаСервере(НомерСтроки)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ЗаписатьТеряемыеДанныеВОбъект(ТекущийОбъект);
	
	СтрокаДляУдаления = ТекущийОбъект.ЭлектронныеЦифровыеПодписи.Найти(НомерСтроки,"НомерСтроки");
	
	МассивСтрокДляУдаления = Новый Массив;
	МассивСтрокДляУдаления.Добавить(СтрокаДляУдаления);
	
	ТекущийОбъект.УдалитьСтрокиЭЦП(МассивСтрокДляУдаления);
	
	
	ОбновитьТеряемыеДанные(ТекущийОбъект,"ФайлыОтчетов");
	ЗначениеВДанныеФормы(ТекущийОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

	
#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНД ФОРМЫ
